Blades_POD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     SRFSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

        );
    }

    wallShearStress1
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
	patches		("BLADE_SURFACE.*")
    }

    yPlus1
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
	patches 	("BLADE_SURFACE.*")
    }

	forceCoeffs1
	{
	type 		forceCoeffs;
	functionObjectLibs ("libforces.so");
	writeControl 	writeTime;
	patches		("BLADE_SURFACE.*")
	writeFields     yes;
	rho         	rhoInf;
	rhoInf      	100000;
	pRef 		0;
	porosity 	no;
	CofR		(0 -25 0);
	dragDir		(0 1 0);
	liftDir		(1 0 0);
	lRef		1;
	Aref		1;
	}
	
	forces1
	{
	type 		forces;
	functionObjectLibs ("libforces.so");
	writeControl 	writeTime;
	patches		("BLADE_SURFACE.*")
	writeFields     yes;
	rho         	rhoInf;
	rhoInf      	100000;
	pRef 		0;
	porosity 	no;
	CofR		(0 -25 0);
	}	



  #includeFunc residuals
  #includeFunc vorticity
  #includeFunc enstrophy
  #includeFunc Q

}





// ************************************************************************* //
