Blades_POD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-25 -75  0)
    ( 25 -75  0)
    ( 25   0  0)
    (-25   0  0)
    (-25 -75  25)
    ( 25 -75  25)
    ( 25   0  25)
    (-25   0  25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 60 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
 
		inlet
        {
            type patch;
            faces
            (
                (4 5 6 7)
            );
        }
		
		outlet
        {
            type patch;
            faces
            (
                (0 3 2 1)
            );
        }
		
		side
        {
            type wall;
            faces
            (
                (0 4 7 3)
		(1 2 6 5)
		(0 1 5 4)
		(3 7 6 2)
            );
        }

);

// ************************************************************************* //
