Blades_POD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
   	type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;

    }
    PERIODIC_11
    {
        type            cyclicAMI;
    }
    PERIODIC_22
    {
        type            cyclicAMI;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    VIRTUAL_SURFACE
    {
        type            slip;
    }
    BLADE_SURFACE
    {
	type            noSlip;
    }
}

// ************************************************************************* //
