Blades_POD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
       type            zeroGradient;
    }
    OUTLET
    {
       type            fixedValue;
       value           uniform 0;
    }
    PERIODIC_11
    {
          type            cyclicAMI;
    }
    PERIODIC_22
    {
          type            cyclicAMI;
    }
    SYMMETRY
    {
      type            symmetry;
    }
    VIRTUAL_SURFACE
    {
      type            zeroGradient;
    }
    BLADE_SURFACE
    {
      type            zeroGradient;
    }
}


// ************************************************************************* //
