Blades_POD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
    }
    VIRTUAL_SURFACE
    {
        type            epsilonWallFunction;
        U               Urel;
        value           uniform 14.855;
    }
    BLADE_SURFACE
    {
        type            epsilonWallFunction;
        U               Urel;
        value           uniform 14.855;
    }
    SYMMETRY 
    {
        type            symmetry;
    }
    PERIODIC_11
    {
        type            cyclicAMI;
    }
    PERIODIC_22
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //

