Blades_POD/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 3.5;

boundaryField
{
    INLET
    {
      	 type  		 fixedValue;
    	 value 		 uniform 3.5;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 3.5;

    }
    PERIODIC_11
    {
        type            cyclicAMI;
        value           uniform 3.5;
    }
    PERIODIC_22
    {
        type            cyclicAMI;
        value           uniform 3.5;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    VIRTUAL_SURFACE
    {
         type            omegaWallFunction;
         value           uniform 3.5;
    }
    BLADE_SURFACE
    {
         type            omegaWallFunction;
         value           uniform 3.5;
    }
}

// ************************************************************************* //
